Revit 2021.1 API
IndependentTag.LeaderEnd Property
 The position of the leader end for a tag using free end leader behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public XYZ LeaderEnd { get; set; }
Visual Basic
Public Property LeaderEnd As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Tags with attached leaders or no leaders do not report leader ends. LeaderEndCondition for the tag's leader condition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no leader end because the tag does not use a free end leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace